     V* ==============================================================
     D* 02/01/22  v1.r1 lanmam
     V* ==============================================================
     D MSGCPY2         S             50
     C                   EVAL      MSGCPY2='Hi I am QILEGEN,TSTCPY02'
     C     MSGCPY2       DSPLY      