     V* ==============================================================
     D* 14/01/22  v1.r1 lana
     V* ==============================================================
     D msg             S             50
     C                   EVAL      msg = 'hello world'
     C     msg           DSPLY      