     V* ==============================================================
     D* 02/01/22  v1.r1 lanmam
     V* ==============================================================
     D msg             S            200
     C                   EVAL      msg = 'Hello I am TSTCAL02'     
     C     msg           DSPLY      
     C                   EVAL      msg = 'Returning to caller'   
     C     msg           DSPLY      
