     V* ==============================================================
     D* 03/02/22  v1.r1 lanmam
     D* Test DOPED
     V* ==============================================================
     D MSG             S             30
     C                   EVAL      MSG='CALLING DOPED PROGRAM'
     C                   CALL      'DOPED'
     C                   EVAL      MSG='CALLED DOPED' 